---
title: 2021-01-15 Ruby Range表現
---

よくあるRange表現。

```ruby
> (1..5).each(&method(:puts))
1
2
3
4
5
=> 1..5
```

文字列でもイケる。

```ruby
> ("1".."5").each(&method(:puts))
1
2
3
4
5
=> "1".."5"
```

実はABC順とかもいける。

```ruby
> ("a".."e").each(&method(:puts))
a
b
c
d
e
=> "a".."e"
```

さらにABC+数値もイケる。

```ruby
> ("a0".."a5").each(&method(:puts))
a0
a1
a2
a3
a4
a5
=> "a0".."a5"
```
